Dlubal.RFEM5.ParallelContactType
Type of contact parallel to surfaces

Dlubal.RFEM5.ParallelContactType.UnknownParallelContactType
Unknown type of parallel contact

Dlubal.RFEM5.ParallelContactType.FailureIfPerpendicularContactFailed
Failure if contact perpendicular to surfaces failed

Dlubal.RFEM5.ParallelContactType.ParallelFullForceTransmissionType
Full force transmission

Dlubal.RFEM5.ParallelContactType.RigidFrictionType
Rigid friction

Dlubal.RFEM5.ParallelContactType.RigidFictionLimitType
Rigid friction with limit

Dlubal.RFEM5.ParallelContactType.ElasticFrictionType
Elastic friction

Dlubal.RFEM5.ParallelContactType.ElasticFrictionLimitType
Elastic friction with limit

Dlubal.RFEM5.ParallelContactType.ElasticSolidBehaviorType
Elastic solid behavior